#+TITLE: Longest Consecutive Sequence
#+DATE: <2026-06-05>
#+FILETAGS: :arrays:
#+PROPERTY: header-args :results output :session *shared*

** Solution

#+begin_src python

nums = [100,4,200,1,3,2]


def longest_consecutive(nums):

    s = set(nums)

    longest = 0
    for n in s:
        if n-1 in s:
            continue
        slen = 1
        while n+1 in s:
            slen += 1
            n += 1
        if slen > longest:
            longest = slen
    return longest

print(longest_consecutive(nums)) # 4

nums = [0,3,7,2,5,8,4,6,0,1]

print(longest_consecutive(nums)) # 9

nums = [1,0,1,2]

print(longest_consecutive(nums)) # 3
#+end_src

#+RESULTS:
: 4
: 9
: 3

